load-test/k6/results/30-min-ingestion-20-vus/insert-app_rust_axum.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 20 max VUs, 30m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 30m0s (gracefulStop: 30s)


     _rust_axum.....................: avg=4.400654 min=1.012  med=4.093  max=909.175  p(90)=5.882  p(95)=6.693 
     data_received..................: 1.4 GB  789 kB/s
     data_sent......................: 1.5 GB  836 kB/s
     http_req_blocked...............: avg=2.96µs   min=0s     med=2µs    max=29.18ms  p(90)=3µs    p(95)=4µs   
     http_req_connecting............: avg=292ns    min=0s     med=0s     max=18.39ms  p(90)=0s     p(95)=0s    
     http_req_duration..............: avg=4.45ms   min=1.03ms med=4.14ms max=909.21ms p(90)=5.93ms p(95)=6.74ms
       { expected_response:true }...: avg=4.45ms   min=1.03ms med=4.14ms max=909.21ms p(90)=5.93ms p(95)=6.74ms
     http_req_failed................: 0.00%   ✓ 0           ✗ 7756667
     http_req_receiving.............: avg=35.58µs  min=11µs   med=31µs   max=314.16ms p(90)=47µs   p(95)=58µs  
     http_req_sending...............: avg=15.97µs  min=5µs    med=14µs   max=52.42ms  p(90)=22µs   p(95)=25µs  
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s       p(90)=0s     p(95)=0s    
     http_req_waiting...............: avg=4.4ms    min=1.01ms med=4.09ms max=909.17ms p(90)=5.88ms p(95)=6.69ms
     http_reqs......................: 7756667 4309.137182/s
     iteration_duration.............: avg=4.62ms   min=1.13ms med=4.31ms max=909.35ms p(90)=6.11ms p(95)=6.92ms
     iterations.....................: 7756667 4309.137182/s
     vus............................: 20      min=20        max=20   
     vus_max........................: 20      min=20        max=20   


running (30m00.1s), 00/20 VUs, 7756667 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  30m0s